In [1]:
import pandas as pd
import numpy as np

In [185]:
from platform import python_version
python_version()

'3.11.2'

In [182]:
pd.__version__

'1.5.3'

In [181]:
np.__version__

'1.24.2'

In [3]:
None, np.nan  # zmienna przecinkowa - pusta

(None, nan)

In [4]:
s = pd.Series([1, 2, 3, np.nan, 6, 8])  # Utworzyliśmy listę
s

0    1.0
1    2.0
2    3.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
type(s)

pandas.core.series.Series

In [6]:
dates = pd.date_range('20130101', periods=6, freq='D')
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [8]:
df = pd.DataFrame({'A' : [1, 2, 3],
                  'B' : [1, 2, 3]})
# DataFrame  - stabeloryzwoane dane
df

   A  B
0  1  1
1  2  2
2  3  3

In [9]:
type(df)

pandas.core.frame.DataFrame

In [43]:
df = pd.DataFrame(np.random.randn(6, 4),
                  index=dates,
                columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.151457  0.750367  0.109555 -1.839631
2013-01-02  1.039342 -0.714659  0.048498  0.235987
2013-01-03 -1.592634 -0.741607  1.590001  0.701558
2013-01-04 -1.037370  0.323646  1.184913 -1.008395
2013-01-05  1.055965  0.557712  0.434243  0.287518
2013-01-06  0.122302 -1.057981  0.578442 -1.012963

In [11]:
type(np.random.randn(6,4))

numpy.ndarray

In [12]:
df2 = pd.DataFrame({
                    'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo',
                    'G' : [False, True,True,False]
                   })
df2

     A          B    C  D      E    F      G
0  1.0 2013-01-02  1.0  3   test  foo  False
1  1.0 2013-01-02  1.0  3  train  foo   True
2  1.0 2013-01-02  1.0  3   test  foo   True
3  1.0 2013-01-02  1.0  3  train  foo  False

In [13]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
 6   G       4 non-null      bool
dtypes: bool(1), category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 292.0+ bytes

Zestaw wstawionych wartości definiuje typ kolumny. Np wstawiamy listę z wartościami bool i typ kolumny to bool. Najważniejsze da nas są wartości w dataframe. Wstawienie jednego stringa do kolumny z integerami zmiania typ całej kolumny np. na object (obiekt).

In [14]:
dane_sprzedaz_df = pd.read_csv('data/dane_sprzedaz.csv', sep=',', encoding='utf-8')
dane_sprzedaz_df

     DZIEN_DATA  SKL_ID  TOW_ID  SPRZ_NETTO  ZYSK_PROCENT ZYSK_WART
0    01.05.2022       1       1       416.0             9     37,44
1    02.05.2022       1       1       454.0             2      9,08
2    03.05.2022       1       1       392.0            13     50,96
3    04.05.2022       1       1       498.0             9     44,82
4    05.05.2022       1       1       341.0            15     51,15
..          ...     ...     ...         ...           ...       ...
130  11.05.2022       3       3       374.0             7     26,18
131  12.05.2022       3       3       390.0             4      15,6
132  13.05.2022       3       3       485.0            10      48,5
133  14.05.2022       3       3       479.0             3     14,37
134  15.05.2022       3       3       366.0            13     47,58

[135 rows x 6 columns]

In [15]:
df.head(3)

                   A         B         C         D
2013-01-01  0.823176 -2.334272 -1.232244  0.351071
2013-01-02  0.493173 -0.136097  0.066933  0.132058
2013-01-03 -0.061904  0.807753  0.316598 -1.737381

In [16]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.239196 -0.734501  0.153512 -1.144180
2013-01-05 -0.086148 -0.112386 -1.698029 -0.220724
2013-01-06 -1.167657 -0.307661  1.177114  0.253378

In [17]:
df.values

array([[ 0.8231759 , -2.33427246, -1.23224381,  0.3510714 ],
       [ 0.49317272, -0.13609714,  0.06693292,  0.13205752],
       [-0.06190429,  0.8077531 ,  0.31659845, -1.73738108],
       [-0.23919565, -0.73450077,  0.15351217, -1.14418005],
       [-0.08614833, -0.11238573, -1.6980293 , -0.2207237 ],
       [-1.16765693, -0.30766142,  1.17711441,  0.25337843]])

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
import numpy as np
import pandas as pd

my_array = np.array([[11,22,33],[44,55,66]])

df_numpy = pd.DataFrame(my_array, columns = ['Column_A','Column_B','Column_C'])

print(df_numpy)
print(type(df_numpy))

   Column_A  Column_B  Column_C
0        11        22        33
1        44        55        66
<class 'pandas.core.frame.DataFrame'>

In [20]:
data = {'col_1': [3, 2, 1, 0], 'col_2': ['a', 'b', 'c', 'd']}
pd.DataFrame.from_dict(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [21]:
df

                   A         B         C         D
2013-01-01  0.823176 -2.334272 -1.232244  0.351071
2013-01-02  0.493173 -0.136097  0.066933  0.132058
2013-01-03 -0.061904  0.807753  0.316598 -1.737381
2013-01-04 -0.239196 -0.734501  0.153512 -1.144180
2013-01-05 -0.086148 -0.112386 -1.698029 -0.220724
2013-01-06 -1.167657 -0.307661  1.177114  0.253378

In [22]:
df.shape

(6, 4)

In [23]:
df.size

24

In [24]:
df.sample(2)

                   A         B         C         D
2013-01-02  0.493173 -0.136097  0.066933  0.132058
2013-01-04 -0.239196 -0.734501  0.153512 -1.144180

In [25]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [26]:
type(df)

pandas.core.frame.DataFrame

In [27]:
df.A

2013-01-01    0.823176
2013-01-02    0.493173
2013-01-03   -0.061904
2013-01-04   -0.239196
2013-01-05   -0.086148
2013-01-06   -1.167657
Freq: D, Name: A, dtype: float64

In [28]:
type(df.A)

pandas.core.series.Series

In [29]:
df.T # transpozycja kolumn z wierszami, zamiana

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.823176    0.493173   -0.061904   -0.239196   -0.086148   -1.167657
B   -2.334272   -0.136097    0.807753   -0.734501   -0.112386   -0.307661
C   -1.232244    0.066933    0.316598    0.153512   -1.698029    1.177114
D    0.351071    0.132058   -1.737381   -1.144180   -0.220724    0.253378

In [30]:
df = df.sample(2)

In [44]:
df

                   A         B         C         D
2013-01-01 -0.151457  0.750367  0.109555 -1.839631
2013-01-02  1.039342 -0.714659  0.048498  0.235987
2013-01-03 -1.592634 -0.741607  1.590001  0.701558
2013-01-04 -1.037370  0.323646  1.184913 -1.008395
2013-01-05  1.055965  0.557712  0.434243  0.287518
2013-01-06  0.122302 -1.057981  0.578442 -1.012963

In [45]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-01 -0.151457  0.750367  0.109555 -1.839631
2013-01-05  1.055965  0.557712  0.434243  0.287518
2013-01-04 -1.037370  0.323646  1.184913 -1.008395
2013-01-02  1.039342 -0.714659  0.048498  0.235987
2013-01-03 -1.592634 -0.741607  1.590001  0.701558
2013-01-06  0.122302 -1.057981  0.578442 -1.012963

In [46]:
df.reset_index()

       index         A         B         C         D
0 2013-01-01 -0.151457  0.750367  0.109555 -1.839631
1 2013-01-02  1.039342 -0.714659  0.048498  0.235987
2 2013-01-03 -1.592634 -0.741607  1.590001  0.701558
3 2013-01-04 -1.037370  0.323646  1.184913 -1.008395
4 2013-01-05  1.055965  0.557712  0.434243  0.287518
5 2013-01-06  0.122302 -1.057981  0.578442 -1.012963

In [47]:
df.reset_index(drop=True)  # Resetujemy indeks i wyrzucamy stary

          A         B         C         D
0 -0.151457  0.750367  0.109555 -1.839631
1  1.039342 -0.714659  0.048498  0.235987
2 -1.592634 -0.741607  1.590001  0.701558
3 -1.037370  0.323646  1.184913 -1.008395
4  1.055965  0.557712  0.434243  0.287518
5  0.122302 -1.057981  0.578442 -1.012963

In [48]:
df.reset_index(drop=False)  # resetujemy ineks i nie wyrzucamy starego

       index         A         B         C         D
0 2013-01-01 -0.151457  0.750367  0.109555 -1.839631
1 2013-01-02  1.039342 -0.714659  0.048498  0.235987
2 2013-01-03 -1.592634 -0.741607  1.590001  0.701558
3 2013-01-04 -1.037370  0.323646  1.184913 -1.008395
4 2013-01-05  1.055965  0.557712  0.434243  0.287518
5 2013-01-06  0.122302 -1.057981  0.578442 -1.012963

In [49]:
df

                   A         B         C         D
2013-01-01 -0.151457  0.750367  0.109555 -1.839631
2013-01-02  1.039342 -0.714659  0.048498  0.235987
2013-01-03 -1.592634 -0.741607  1.590001  0.701558
2013-01-04 -1.037370  0.323646  1.184913 -1.008395
2013-01-05  1.055965  0.557712  0.434243  0.287518
2013-01-06  0.122302 -1.057981  0.578442 -1.012963

In [50]:
# Agregacja na df

In [51]:
df.sum()

A   -0.563852
B   -0.882521
C    3.945654
D   -2.635926
dtype: float64

In [52]:
df.min()

A   -1.592634
B   -1.057981
C    0.048498
D   -1.839631
dtype: float64

In [53]:
df.mean()

A   -0.093975
B   -0.147087
C    0.657609
D   -0.439321
dtype: float64

In [55]:
df[['A']]

                   A
2013-01-01 -0.151457
2013-01-02  1.039342
2013-01-03 -1.592634
2013-01-04 -1.037370
2013-01-05  1.055965
2013-01-06  0.122302

In [56]:
df[['A','B']]

                   A         B
2013-01-01 -0.151457  0.750367
2013-01-02  1.039342 -0.714659
2013-01-03 -1.592634 -0.741607
2013-01-04 -1.037370  0.323646
2013-01-05  1.055965  0.557712
2013-01-06  0.122302 -1.057981

In [57]:
df['A']

2013-01-01   -0.151457
2013-01-02    1.039342
2013-01-03   -1.592634
2013-01-04   -1.037370
2013-01-05    1.055965
2013-01-06    0.122302
Freq: D, Name: A, dtype: float64

In [58]:
df[['A','B']].sum()

A   -0.563852
B   -0.882521
dtype: float64

In [60]:
df['A'][0]

-0.15145700070289253

In [63]:
df

                   A         B         C         D
2013-01-01 -0.151457  0.750367  0.109555 -1.839631
2013-01-02  1.039342 -0.714659  0.048498  0.235987
2013-01-03 -1.592634 -0.741607  1.590001  0.701558
2013-01-04 -1.037370  0.323646  1.184913 -1.008395
2013-01-05  1.055965  0.557712  0.434243  0.287518
2013-01-06  0.122302 -1.057981  0.578442 -1.012963

In [64]:
df[0:3] # Pokazuje od 0 do 3, bez 3 (zakres otwarty)

                   A         B         C         D
2013-01-01 -0.151457  0.750367  0.109555 -1.839631
2013-01-02  1.039342 -0.714659  0.048498  0.235987
2013-01-03 -1.592634 -0.741607  1.590001  0.701558

In [65]:
df['2013-01-01':'2013-01-03']

                   A         B         C         D
2013-01-01 -0.151457  0.750367  0.109555 -1.839631
2013-01-02  1.039342 -0.714659  0.048498  0.235987
2013-01-03 -1.592634 -0.741607  1.590001  0.701558

In [66]:
# Label vs. location: The main distinction between the two methods is:

# loc gets rows (and/or columns) with particular labels.

# iloc gets rows (and/or columns) at integer locations.

In [67]:
b = pd.Series(np.round(np.random.uniform(0,1,10),2))
i = np.r_[0:10]
np.random.shuffle(i)
b.index = i
b

5    0.73
1    0.64
0    0.96
2    0.53
9    0.69
4    0.79
3    0.63
7    0.16
8    0.71
6    0.43
dtype: float64

In [68]:
b.iloc[2]

0.96

In [69]:
b.loc[2]

0.53

In [70]:
b.iloc[0:2]

5    0.73
1    0.64
dtype: float64

In [71]:
b.loc[0:2]

0    0.96
2    0.53
dtype: float64

In [72]:
df

                   A         B         C         D
2013-01-01 -0.151457  0.750367  0.109555 -1.839631
2013-01-02  1.039342 -0.714659  0.048498  0.235987
2013-01-03 -1.592634 -0.741607  1.590001  0.701558
2013-01-04 -1.037370  0.323646  1.184913 -1.008395
2013-01-05  1.055965  0.557712  0.434243  0.287518
2013-01-06  0.122302 -1.057981  0.578442 -1.012963

In [76]:
df.loc[dates[0]:dates[2]]

                   A         B         C         D
2013-01-01 -0.151457  0.750367  0.109555 -1.839631
2013-01-02  1.039342 -0.714659  0.048498  0.235987
2013-01-03 -1.592634 -0.741607  1.590001  0.701558

In [74]:
df.iloc[2:4]

                   A         B         C         D
2013-01-03 -1.592634 -0.741607  1.590001  0.701558
2013-01-04 -1.037370  0.323646  1.184913 -1.008395

In [77]:
df.loc[dates[2]:dates[0]]  # Nie radzi sobie z odwrotną kolejnością

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [78]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.151457  0.750367  0.109555 -1.839631
2013-01-02  1.039342 -0.714659  0.048498  0.235987
2013-01-03 -1.592634 -0.741607  1.590001  0.701558

In [82]:
df[2:-2]

                   A         B         C         D
2013-01-03 -1.592634 -0.741607  1.590001  0.701558
2013-01-04 -1.037370  0.323646  1.184913 -1.008395

In [81]:
df[-3:] # Podgląd ostatnich 3 wartości

                   A         B         C         D
2013-01-04 -1.037370  0.323646  1.184913 -1.008395
2013-01-05  1.055965  0.557712  0.434243  0.287518
2013-01-06  0.122302 -1.057981  0.578442 -1.012963

In [83]:
dates[0]

Timestamp('2013-01-01 00:00:00', freq='D')

In [84]:
df.loc[dates[0],'A']

-0.15145700070289253

In [85]:
df.at[dates[0],'A']

-0.15145700070289253

In [89]:
df.loc[dates[0:2],['A', 'B']]

                   A         B
2013-01-01 -0.151457  0.750367
2013-01-02  1.039342 -0.714659

In [90]:
df[df.A < 0]

                   A         B         C         D
2013-01-01 -0.151457  0.750367  0.109555 -1.839631
2013-01-03 -1.592634 -0.741607  1.590001  0.701558
2013-01-04 -1.037370  0.323646  1.184913 -1.008395

In [91]:
df[(df.A > 0) & (df.B > 0)]  # and

                   A         B         C         D
2013-01-05  1.055965  0.557712  0.434243  0.287518

In [92]:
df[(df.A > 0) | (df.B > 0)]  # or

                   A         B         C         D
2013-01-01 -0.151457  0.750367  0.109555 -1.839631
2013-01-02  1.039342 -0.714659  0.048498  0.235987
2013-01-04 -1.037370  0.323646  1.184913 -1.008395
2013-01-05  1.055965  0.557712  0.434243  0.287518
2013-01-06  0.122302 -1.057981  0.578442 -1.012963

In [102]:
df3 = df.copy()

In [103]:
df3

                   A         B         C         D
2013-01-01 -0.151457  0.750367  0.109555 -1.839631
2013-01-02  1.039342 -0.714659  0.048498  0.235987
2013-01-03 -1.592634 -0.741607  1.590001  0.701558
2013-01-04 -1.037370  0.323646  1.184913 -1.008395
2013-01-05  1.055965  0.557712  0.434243  0.287518
2013-01-06  0.122302 -1.057981  0.578442 -1.012963

In [104]:
df3.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [105]:
df3.columns = ['E', 'F', 'G', 'H']

In [106]:
df3.columns

Index(['E', 'F', 'G', 'H'], dtype='object')

In [110]:
df3 = df3.rename(columns={'E':'A'})
df3

                   A         F         G         H
2013-01-01 -0.151457  0.750367  0.109555 -1.839631
2013-01-02  1.039342 -0.714659  0.048498  0.235987
2013-01-03 -1.592634 -0.741607  1.590001  0.701558
2013-01-04 -1.037370  0.323646  1.184913 -1.008395
2013-01-05  1.055965  0.557712  0.434243  0.287518
2013-01-06  0.122302 -1.057981  0.578442 -1.012963

In [111]:
df2 = df.copy()
df2

                   A         B         C         D
2013-01-01 -0.151457  0.750367  0.109555 -1.839631
2013-01-02  1.039342 -0.714659  0.048498  0.235987
2013-01-03 -1.592634 -0.741607  1.590001  0.701558
2013-01-04 -1.037370  0.323646  1.184913 -1.008395
2013-01-05  1.055965  0.557712  0.434243  0.287518
2013-01-06  0.122302 -1.057981  0.578442 -1.012963

In [122]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', np.nan]  # Dołączenie nowej kolumny z nast. wierszami
df2

                   A         B         C         D      E
2013-01-01 -0.151457  0.750367  0.109555 -1.839631    one
2013-01-02  1.039342 -0.714659  0.048498  0.235987    one
2013-01-03 -1.592634 -0.741607  1.590001  0.701558    two
2013-01-04 -1.037370  0.323646  1.184913 -1.008395  three
2013-01-05  1.055965  0.557712  0.434243  0.287518   four
2013-01-06  0.122302 -1.057981  0.578442 -1.012963    NaN

In [117]:
df2[df2['E'].isin(['one','two'])]  # Wyświetlenie wierszy, które w kolumnie E zawierają wartości 'one' oraz 'two'

                   A         B         C         D    E
2013-01-01 -0.151457  0.750367  0.109555 -1.839631  one
2013-01-02  1.039342 -0.714659  0.048498  0.235987  one
2013-01-03 -1.592634 -0.741607  1.590001  0.701558  two

In [118]:
df2

                   A         B         C         D      E
2013-01-01 -0.151457  0.750367  0.109555 -1.839631    one
2013-01-02  1.039342 -0.714659  0.048498  0.235987    one
2013-01-03 -1.592634 -0.741607  1.590001  0.701558    two
2013-01-04 -1.037370  0.323646  1.184913 -1.008395  three
2013-01-05  1.055965  0.557712  0.434243  0.287518   four
2013-01-06  0.122302 -1.057981  0.578442 -1.012963   five

In [121]:
df2[df2.E.str.contains('ree', regex=True, na=False)]  # Wyszukuje wszystko co zawiera 'ree' w kolumnie E, regex=True - wyszukuje uwzgledniajac kodowanie regex w polu szukanej frazy (nie trzeba pisać kiedy false)

                  A         B         C         D      E
2013-01-04 -1.03737  0.323646  1.184913 -1.008395  three

In [123]:
df2[df2.E.str.contains('ree', regex=True, na=True)] # Uwzględnia także brak danych

                   A         B         C         D      E
2013-01-04 -1.037370  0.323646  1.184913 -1.008395  three
2013-01-06  0.122302 -1.057981  0.578442 -1.012963    NaN

In [126]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [127]:
df2['F'] = s1
df2

                   A         B         C         D      E    F
2013-01-01 -0.151457  0.750367  0.109555 -1.839631    one  NaN
2013-01-02  1.039342 -0.714659  0.048498  0.235987    one  1.0
2013-01-03 -1.592634 -0.741607  1.590001  0.701558    two  2.0
2013-01-04 -1.037370  0.323646  1.184913 -1.008395  three  3.0
2013-01-05  1.055965  0.557712  0.434243  0.287518   four  4.0
2013-01-06  0.122302 -1.057981  0.578442 -1.012963    NaN  5.0

In [128]:
df2['F'] = 5
df2

                   A         B         C         D      E  F
2013-01-01 -0.151457  0.750367  0.109555 -1.839631    one  5
2013-01-02  1.039342 -0.714659  0.048498  0.235987    one  5
2013-01-03 -1.592634 -0.741607  1.590001  0.701558    two  5
2013-01-04 -1.037370  0.323646  1.184913 -1.008395  three  5
2013-01-05  1.055965  0.557712  0.434243  0.287518   four  5
2013-01-06  0.122302 -1.057981  0.578442 -1.012963    NaN  5

In [129]:
df = pd.DataFrame(np.random.randn(6, 4), 
                  index=dates, 
                  columns=list('ABCD'))
df['D'] = -5
df['E'] = [np.nan, -1,-2,-3, -4, -5]
df['F'] = [1,2, np.nan, np.nan,np.nan, np.nan]
df

                   A         B         C  D    E    F
2013-01-01  0.819605 -0.584325 -0.317403 -5  NaN  1.0
2013-01-02  0.064769 -0.755940 -0.188296 -5 -1.0  2.0
2013-01-03  0.735184 -0.841173 -0.066560 -5 -2.0  NaN
2013-01-04  1.819712 -0.437252  0.163706 -5 -3.0  NaN
2013-01-05 -0.132028  1.995567  0.275180 -5 -4.0  NaN
2013-01-06  0.370705 -0.820874 -0.116115 -5 -5.0  NaN

In [130]:
pd.isna(df)  # Sprawdzamy gdzie w tabeli mamy wartości NaN

                A      B      C      D      E      F
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True
2013-01-05  False  False  False  False  False   True
2013-01-06  False  False  False  False  False   True

In [131]:
df.isna().any(axis=1)  # Sprawdzamy po wierszach czy warunek isna() jest spełniony

2013-01-01     True
2013-01-02    False
2013-01-03     True
2013-01-04     True
2013-01-05     True
2013-01-06     True
Freq: D, dtype: bool

In [132]:
df[df.isna().any(axis=1)]  # Wyświetlamy wiersze zawierające NaN

                   A         B         C  D    E    F
2013-01-01  0.819605 -0.584325 -0.317403 -5  NaN  1.0
2013-01-03  0.735184 -0.841173 -0.066560 -5 -2.0  NaN
2013-01-04  1.819712 -0.437252  0.163706 -5 -3.0  NaN
2013-01-05 -0.132028  1.995567  0.275180 -5 -4.0  NaN
2013-01-06  0.370705 -0.820874 -0.116115 -5 -5.0  NaN

In [134]:
df.dropna()  # Odrzuca wszytskei wiersze zawierające przynajmniej NaN

                   A        B         C  D    E    F
2013-01-02  0.064769 -0.75594 -0.188296 -5 -1.0  2.0

In [136]:
df.dropna(how='any')  # Odrzuca wszytskei wiersze zawierające przynajmniej raz NaN, default

                   A        B         C  D    E    F
2013-01-02  0.064769 -0.75594 -0.188296 -5 -1.0  2.0

In [137]:
df.dropna(how='all')  # Odrzuca wszytskie wiersze zawierające tylko NaN

                   A         B         C  D    E    F
2013-01-01  0.819605 -0.584325 -0.317403 -5  NaN  1.0
2013-01-02  0.064769 -0.755940 -0.188296 -5 -1.0  2.0
2013-01-03  0.735184 -0.841173 -0.066560 -5 -2.0  NaN
2013-01-04  1.819712 -0.437252  0.163706 -5 -3.0  NaN
2013-01-05 -0.132028  1.995567  0.275180 -5 -4.0  NaN
2013-01-06  0.370705 -0.820874 -0.116115 -5 -5.0  NaN

In [138]:
df.fillna(5)  # Wypełnianie wszytskich NaN wartością '5'

                   A         B         C  D    E    F
2013-01-01  0.819605 -0.584325 -0.317403 -5  5.0  1.0
2013-01-02  0.064769 -0.755940 -0.188296 -5 -1.0  2.0
2013-01-03  0.735184 -0.841173 -0.066560 -5 -2.0  5.0
2013-01-04  1.819712 -0.437252  0.163706 -5 -3.0  5.0
2013-01-05 -0.132028  1.995567  0.275180 -5 -4.0  5.0
2013-01-06  0.370705 -0.820874 -0.116115 -5 -5.0  5.0

In [139]:
df.fillna(method='ffill')  # Wypełnianie wszytskich NaN wartością poprzedzajacą

                   A         B         C  D    E    F
2013-01-01  0.819605 -0.584325 -0.317403 -5  NaN  1.0
2013-01-02  0.064769 -0.755940 -0.188296 -5 -1.0  2.0
2013-01-03  0.735184 -0.841173 -0.066560 -5 -2.0  2.0
2013-01-04  1.819712 -0.437252  0.163706 -5 -3.0  2.0
2013-01-05 -0.132028  1.995567  0.275180 -5 -4.0  2.0
2013-01-06  0.370705 -0.820874 -0.116115 -5 -5.0  2.0

In [140]:
df.fillna(method='bfill')  # Wypełnianie wszytskich NaN wartością następną

                   A         B         C  D    E    F
2013-01-01  0.819605 -0.584325 -0.317403 -5 -1.0  1.0
2013-01-02  0.064769 -0.755940 -0.188296 -5 -1.0  2.0
2013-01-03  0.735184 -0.841173 -0.066560 -5 -2.0  NaN
2013-01-04  1.819712 -0.437252  0.163706 -5 -3.0  NaN
2013-01-05 -0.132028  1.995567  0.275180 -5 -4.0  NaN
2013-01-06  0.370705 -0.820874 -0.116115 -5 -5.0  NaN

In [141]:
df.fillna(df.mean()) # Wypełanianie NaN średnią

                   A         B         C  D    E    F
2013-01-01  0.819605 -0.584325 -0.317403 -5 -3.0  1.0
2013-01-02  0.064769 -0.755940 -0.188296 -5 -1.0  2.0
2013-01-03  0.735184 -0.841173 -0.066560 -5 -2.0  1.5
2013-01-04  1.819712 -0.437252  0.163706 -5 -3.0  1.5
2013-01-05 -0.132028  1.995567  0.275180 -5 -4.0  1.5
2013-01-06  0.370705 -0.820874 -0.116115 -5 -5.0  1.5

In [142]:
df = pd.DataFrame({'DZIEN_ID' : [1,2,3,4,5,6,7],
                   'SPRZEDAZ' : [100,150,300,np.nan,0,200,400],
                   'CENA' : [2.3, 2.2, 1.99, 2.4, np.nan, 2.1, 2.1],
                   'DZIEN_WOLNY' : [0,0,0,0,1,0,0],
                   'MECZ' : [0,0,0,1,0,0,0],
                  })
df

   DZIEN_ID  SPRZEDAZ  CENA  DZIEN_WOLNY  MECZ
0         1     100.0  2.30            0     0
1         2     150.0  2.20            0     0
2         3     300.0  1.99            0     0
3         4       NaN  2.40            0     1
4         5       0.0   NaN            1     0
5         6     200.0  2.10            0     0
6         7     400.0  2.10            0     0

In [143]:
df = pd.DataFrame(np.random.randn(6, 4), 
                  index=dates, 
                  columns=list('ABCD'))
df['D'] = -5
df['E'] = [np.nan, -1,-2,-3, -4, -5]
df['F'] = [1,2, np.nan, np.nan,np.nan, np.nan]
df

                   A         B         C  D    E    F
2013-01-01  1.620242 -0.246837 -1.254172 -5  NaN  1.0
2013-01-02  0.617910 -1.472696 -1.829286 -5 -1.0  2.0
2013-01-03  1.054653 -0.243775 -0.718427 -5 -2.0  NaN
2013-01-04 -0.430333  0.375599  1.216446 -5 -3.0  NaN
2013-01-05  0.924868 -1.189604 -0.530793 -5 -4.0  NaN
2013-01-06  0.887921  0.611685 -0.564144 -5 -5.0  NaN

In [144]:
df = pd.DataFrame(np.random.randn(6, 4), 
                  index=dates, 
                  columns=list('ABCD'))
df['D'] = -5
df['E'] = [np.nan, -1,-2,-3, -4, -5]
df['F'] = [1,2, np.nan, np.nan,np.nan, np.nan]
df

                   A         B         C  D    E    F
2013-01-01 -0.540695 -0.812932 -0.160134 -5  NaN  1.0
2013-01-02  0.087530 -0.514051  0.349178 -5 -1.0  2.0
2013-01-03  0.234132 -1.930281  1.680271 -5 -2.0  NaN
2013-01-04 -1.137131 -1.089103 -1.601275 -5 -3.0  NaN
2013-01-05 -0.627792  0.635829 -0.133867 -5 -4.0  NaN
2013-01-06  0.207318  1.846561  0.729082 -5 -5.0  NaN

In [145]:
values = [40, 38, 32.5, 27, 33, 34]
 
df['new_col'] = values

s1 = pd.Series([40.5, 38.5, 33, 28, 26, 25], 
               index=[0, 1, 2, 3, 4, 5])
s2 = pd.Series([48.5, 42, 41, 37, 40, 39], 
               index=[0, 1, 2, 3, 4, 5])
 
df = df.assign(science_score=s1.values, 
                 english_score=s2.values)
df

,A,B,C,D,E,F,new_col,science_score,english_score
2013-01-01,-0.540695,-0.812932,-0.160134,-5,NaN,1.0,40.0,40.5,48.5
2013-01-02,0.087530,-0.514051,0.349178,-5,-1.0,2.0,38.0,38.5,42.0
2013-01-03,0.234132,-1.930281,1.680271,-5,-2.0,NaN,32.5,33.0,41.0
2013-01-04,-1.137131,-1.089103,-1.601275,-5,-3.0,NaN,27.0,28.0,37.0
2013-01-05,-0.627792,0.635829,-0.133867,-5,-4.0,NaN,33.0,26.0,40.0
2013-01-06,0.207318,1.846561,0.729082,-5,-5.0,NaN,34.0,25.0,39.0

In [146]:
df.A.values

array([-0.54069484,  0.08752958,  0.2341316 , -1.13713119, -0.6277916 ,
        0.20731839])

In [150]:
df['avg_score'] = df.apply(lambda row:((row.new_col + row.science_score) / 2), axis=1)
# par. axis =: 0 - lecimy po wierszach, 1 - lecimy po kolumnach
# lamba - doczytać!!!!!
df

,A,B,C,D,E,F,new_col,science_score,english_score,avg_score
2013-01-01,-0.540695,-0.812932,-0.160134,-5,NaN,1.0,40.0,40.5,48.5,40.25
2013-01-02,0.087530,-0.514051,0.349178,-5,-1.0,2.0,38.0,38.5,42.0,38.25
2013-01-03,0.234132,-1.930281,1.680271,-5,-2.0,NaN,32.5,33.0,41.0,32.75
2013-01-04,-1.137131,-1.089103,-1.601275,-5,-3.0,NaN,27.0,28.0,37.0,27.50
2013-01-05,-0.627792,0.635829,-0.133867,-5,-4.0,NaN,33.0,26.0,40.0,29.50
2013-01-06,0.207318,1.846561,0.729082,-5,-5.0,NaN,34.0,25.0,39.0,29.50

In [152]:
df.drop(['C'], axis=1)

,A,B,D,E,F,new_col,science_score,english_score,avg_score
2013-01-01,-0.540695,-0.812932,-5,NaN,1.0,40.0,40.5,48.5,40.25
2013-01-02,0.087530,-0.514051,-5,-1.0,2.0,38.0,38.5,42.0,38.25
2013-01-03,0.234132,-1.930281,-5,-2.0,NaN,32.5,33.0,41.0,32.75
2013-01-04,-1.137131,-1.089103,-5,-3.0,NaN,27.0,28.0,37.0,27.50
2013-01-05,-0.627792,0.635829,-5,-4.0,NaN,33.0,26.0,40.0,29.50
2013-01-06,0.207318,1.846561,-5,-5.0,NaN,34.0,25.0,39.0,29.50

In [153]:
df2 = df.reset_index()

In [154]:
df2

,index,A,B,C,D,E,F,new_col,science_score,english_score,avg_score
0,2013-01-01,-0.540695,-0.812932,-0.160134,-5,NaN,1.0,40.0,40.5,48.5,40.25
1,2013-01-02,0.087530,-0.514051,0.349178,-5,-1.0,2.0,38.0,38.5,42.0,38.25
2,2013-01-03,0.234132,-1.930281,1.680271,-5,-2.0,NaN,32.5,33.0,41.0,32.75
3,2013-01-04,-1.137131,-1.089103,-1.601275,-5,-3.0,NaN,27.0,28.0,37.0,27.50
4,2013-01-05,-0.627792,0.635829,-0.133867,-5,-4.0,NaN,33.0,26.0,40.0,29.50
5,2013-01-06,0.207318,1.846561,0.729082,-5,-5.0,NaN,34.0,25.0,39.0,29.50

In [156]:
df2[(df2['index'] > '2013-01-02') & (df2['index'] < '2013-01-04')]

,index,A,B,C,D,E,F,new_col,science_score,english_score,avg_score
2,2013-01-03,0.234132,-1.930281,1.680271,-5,-2.0,NaN,32.5,33.0,41.0,32.75

In [157]:
df_groupby = pd.DataFrame(np.random.randn(10, 4))
df_groupby

          0         1         2         3
0 -0.870256 -0.470663 -0.490592  0.198249
1  0.815694  0.158703 -0.705479  1.508817
2  0.136660  0.391352 -0.507789 -1.705968
3 -0.740181  0.976023 -0.323228  0.622140
4  0.677289  1.277159  0.837407  0.756704
5  1.359948 -0.711142  0.432705 -0.780853
6 -0.533587  0.484061 -0.930802 -0.660522
7 -0.634494 -1.539989  0.482021  1.108449
8 -2.011884  0.387271 -0.436289  0.187658
9 -0.806472 -1.178419 -2.224813  0.235547

In [158]:
df_groupby[:3]

          0         1         2         3
0 -0.870256 -0.470663 -0.490592  0.198249
1  0.815694  0.158703 -0.705479  1.508817
2  0.136660  0.391352 -0.507789 -1.705968

In [159]:
df_groupby[3:6]

          0         1         2         3
3 -0.740181  0.976023 -0.323228  0.622140
4  0.677289  1.277159  0.837407  0.756704
5  1.359948 -0.711142  0.432705 -0.780853

In [160]:
pieces = [df_groupby[:3], df_groupby[3:7], df_groupby[7:]]  # podział wg wierszy

In [161]:
pieces

[          0         1         2         3
 0 -0.870256 -0.470663 -0.490592  0.198249
 1  0.815694  0.158703 -0.705479  1.508817
 2  0.136660  0.391352 -0.507789 -1.705968,
           0         1         2         3
 3 -0.740181  0.976023 -0.323228  0.622140
 4  0.677289  1.277159  0.837407  0.756704
 5  1.359948 -0.711142  0.432705 -0.780853
 6 -0.533587  0.484061 -0.930802 -0.660522,
           0         1         2         3
 7 -0.634494 -1.539989  0.482021  1.108449
 8 -2.011884  0.387271 -0.436289  0.187658
 9 -0.806472 -1.178419 -2.224813  0.235547]

In [162]:
pieces[0]

          0         1         2         3
0 -0.870256 -0.470663 -0.490592  0.198249
1  0.815694  0.158703 -0.705479  1.508817
2  0.136660  0.391352 -0.507789 -1.705968

In [164]:
pd.concat(pieces)

          0         1         2         3
0 -0.870256 -0.470663 -0.490592  0.198249
1  0.815694  0.158703 -0.705479  1.508817
2  0.136660  0.391352 -0.507789 -1.705968
3 -0.740181  0.976023 -0.323228  0.622140
4  0.677289  1.277159  0.837407  0.756704
5  1.359948 -0.711142  0.432705 -0.780853
6 -0.533587  0.484061 -0.930802 -0.660522
7 -0.634494 -1.539989  0.482021  1.108449
8 -2.011884  0.387271 -0.436289  0.187658
9 -0.806472 -1.178419 -2.224813  0.235547

In [167]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [168]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [170]:
merged = pd.merge(left, right, on='key')
merged

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [171]:
df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
df1

     a  b
0  foo  1
1  bar  2

In [172]:
df2 = pd.DataFrame({'c': ['foo', 'baz'], 'b': [2, 4]})
df2

     c  b
0  foo  2
1  baz  4

In [173]:
df1.merge(df2, how='left', on='b')
# do tabeli df1 dolaczamy zawartosc tabeli df2 po kluczu b, df1 jest wazneijsze

     a  b    c
0  foo  1  NaN
1  bar  2  foo

In [174]:
df1.merge(df2, how='right', on='b')
# Do tabeli df2 dolaczamy df1 w tym co jest wspólne

     a  b    c
0  bar  2  foo
1  NaN  4  baz

In [175]:
df1.merge(df2, how='inner', on='b')
# efektem jest tylko wspolne b z df1 i df2

     a  b    c
0  bar  2  foo

In [176]:
df1.merge(df2, how='outer', on='b')
# wszytsko + laczy te same b

     a  b    c
0  foo  1  NaN
1  bar  2  foo
2  NaN  4  baz

In [178]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                         'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one -1.009837 -2.679580
1  bar    one -0.013680  0.858357
2  foo    two -1.479413 -0.980777
3  bar  three -0.022512  0.941302
4  foo    two -2.163551  0.360967
5  bar    two  2.958305  0.472466
6  foo    one  2.160387 -0.046016
7  foo  three  0.646136 -1.485826

In [204]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [180]:
df.groupby('A').sum()
# Grupujemy po tym co jest w kolumnie 'A' i następnie liczymy z tego sumę

C:\Users\Kacper\AppData\Local\Temp\ipykernel_20256\1885751491.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('A').sum()

            C         D
A
bar  2.922113  2.272125
foo -1.846279 -4.831233

In [186]:
df.groupby(['A', 'B']).sum()
# Tutaj tworzymy multiindeks. Z kolumn a i B stworzylismy multiindeks zastepujacy indeks 0-7

                  C         D
A   B
bar one   -0.013680  0.858357
    three -0.022512  0.941302
    two    2.958305  0.472466
foo one    1.150549 -2.725596
    three  0.646136 -1.485826
    two   -3.642965 -0.619811

In [191]:
df2['C']

A    B
bar  one     -0.013680
     three   -0.022512
     two      2.958305
foo  one      1.150549
     three    0.646136
     two     -3.642965
Name: C, dtype: float64

In [192]:
df2['D']

A    B
bar  one      0.858357
     three    0.941302
     two      0.472466
foo  one     -2.725596
     three   -1.485826
     two     -0.619811
Name: D, dtype: float64

In [187]:
df[['A','B']]

In [188]:
df2

                  C         D
A   B
bar one   -0.013680  0.858357
    three -0.022512  0.941302
    two    2.958305  0.472466
foo one    1.150549 -2.725596
    three  0.646136 -1.485826
    two   -3.642965 -0.619811

In [189]:
df2.loc['bar', 'one']

C   -0.013680
D    0.858357
Name: (bar, one), dtype: float64

In [190]:
df2.reset_index(drop=False)

     A      B         C         D
0  bar    one -0.013680  0.858357
1  bar  three -0.022512  0.941302
2  bar    two  2.958305  0.472466
3  foo    one  1.150549 -2.725596
4  foo  three  0.646136 -1.485826
5  foo    two -3.642965 -0.619811

In [193]:
midx = pd.MultiIndex(
    levels=[["zero2", "one"],
            ["x", "y"]], 
    codes=[[1, 1, 0, 0], [1, 0, 1, 0]]
)


df_indeksy = pd.DataFrame(np.random.randn(4, 2), index=midx)
df_indeksy

                0         1
one   y  0.531108 -0.439676
      x -0.971948  0.368259
zero2 y -0.291159  0.382267
      x -0.981206  1.743227

In [195]:
df_indeksy.loc['one', 'y']

0    0.531108
1   -0.439676
Name: (one, y), dtype: float64

In [198]:
df_indeksy.columns = ['jeden','dwa']

In [199]:
df_indeksy

            jeden       dwa
one   y  0.531108 -0.439676
      x -0.971948  0.368259
zero2 y -0.291159  0.382267
      x -0.981206  1.743227

In [201]:
df_indeksy.loc[:, ['jeden', 'dwa']]

            jeden       dwa
one   y  0.531108 -0.439676
      x -0.971948  0.368259
zero2 y -0.291159  0.382267
      x -0.981206  1.743227

In [203]:
df_indeksy[['jeden', 'dwa']]

            jeden       dwa
one   y  0.531108 -0.439676
      x -0.971948  0.368259
zero2 y -0.291159  0.382267
      x -0.981206  1.743227